; domain
(define (domain instance_20_5_2_1-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :numeric-fluents)
 (:types block)
 (:predicates  (dummy-predicate))
 (:functions (x ?b - block) (y ?b - block) (max_x) (min_x) (max_y) (min_y))
 (:action move_block_up
  :parameters ( ?b - block)
  :precondition (and (<= (+ 1 (y ?b)) (max_y)))
  :effect (and (increase (y ?b) 1)))
 (:action move_block_down
  :parameters ( ?b - block)
  :precondition (and (<= (min_y) (- (y ?b) 1)))
  :effect (and (decrease (y ?b) 1)))
 (:action move_block_right
  :parameters ( ?b - block)
  :precondition (and (<= (+ 1 (x ?b)) (max_x)))
  :effect (and (increase (x ?b) 1)))
 (:action move_block_left
  :parameters ( ?b - block)
  :precondition (and (<= (min_x) (- (x ?b) 1)))
  :effect (and (decrease (x ?b) 1)))
)

; problem
(define (problem instance_20_5_2_1-problem)
 (:domain instance_20_5_2_1-domain)
 (:objects
   b1 b2 b3 b4 b5 - block
 )
 (:init (= (x b3) 17) (= (y b3) 14) (= (x b4) 17) (= (y b4) 8) (= (x b2) 19) (= (y b2) 5) (= (x b1) 20) (= (y b1) 14) (= (x b5) 5) (= (y b5) 5) (= (max_x) 20) (= (min_x) 1) (= (max_y) 20) (= (min_y) 1))
 (:goal (and (= (x b1) (x b2)) (= (y b1) (y b2)) (= (x b1) (x b3)) (= (y b1) (y b3)) (= (x b1) (x b4)) (= (y b1) (y b4)) (or (not (= (x b1) (x b5))) (not (= (y b1) (y b5)))) (= (x b2) (x b3)) (= (y b2) (y b3)) (= (x b2) (x b4)) (= (y b2) (y b4)) (or (not (= (x b2) (x b5))) (not (= (y b2) (y b5)))) (= (x b3) (x b4)) (= (y b3) (y b4)) (or (not (= (x b3) (x b5))) (not (= (y b3) (y b5)))) (or (not (= (x b4) (x b5))) (not (= (y b4) (y b5))))))
)

; plan
1. (move_block_up b2)
   changed: (y b2) from 5 to 6
   goals met: 6 of 16
2. (move_block_up b2)
   changed: (y b2) from 6 to 7
   goals met: 6 of 16
3. (move_block_up b2)
   changed: (y b2) from 7 to 8
   goals met: 7 of 16
4. (move_block_left b1)
   changed: (x b1) from 20 to 19
   goals met: 8 of 16
5. (move_block_down b3)
   changed: (y b3) from 14 to 13
   goals met: 7 of 16
6. (move_block_down b1)
   changed: (y b1) from 14 to 13
   goals met: 8 of 16
7. (move_block_down b3)
   changed: (y b3) from 13 to 12
   goals met: 7 of 16
8. (move_block_down b1)
   changed: (y b1) from 13 to 12
   goals met: 8 of 16
9. (move_block_down b3)
   changed: (y b3) from 12 to 11
   goals met: 7 of 16
10. (move_block_down b1)
   changed: (y b1) from 12 to 11
   goals met: 8 of 16
11. (move_block_down b3)
   changed: (y b3) from 11 to 10
   goals met: 7 of 16
12. (move_block_down b1)
   changed: (y b1) from 11 to 10
   goals met: 8 of 16
13. (move_block_down b3)
   changed: (y b3) from 10 to 9
   goals met: 7 of 16
14. (move_block_down b1)
   changed: (y b1) from 10 to 9
   goals met: 8 of 16
15. (move_block_down b3)
   changed: (y b3) from 9 to 8
   goals met: 9 of 16
16. (move_block_down b1)
   changed: (y b1) from 9 to 8
   goals met: 12 of 16
17. (move_block_right b4)
   changed: (x b4) from 17 to 18
   goals met: 11 of 16
18. (move_block_right b3)
   changed: (x b3) from 17 to 18
   goals met: 12 of 16
19. (move_block_right b4)
   changed: (x b4) from 18 to 19
   goals met: 13 of 16
20. (move_block_right b3)
   changed: (x b3) from 18 to 19
   goals met: 16 of 16
